3.Снабдить репозиторий оформленным текстовым файлом решения 
4.Написать программу решающую поставленную задачу(Задача - Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма
При решении не рекомендуеться пользоваться коллекциями, лучше обойтись исключительно массивами)
Решение (код)
Console.Write("Введите массив данных через ',': ");
string strLine = Console.ReadLine();
string[] inArr = strLine.Split(",");
string[] outArr = new string[0];

for (int i = 0; i < inArr.Length; i++)
{
    if (inArr[i].Length <= 3)
    {
        Array.Resize(ref outArr, outArr.Length + 1);
        outArr[outArr.Length-1] = inArr[i];
    }

}
Console.WriteLine($"[{string.Join(",", inArr)}]=>[{string.Join(",", outArr)}]");
5.Использовать контроль версий в работе над этим небольшим проектом (не должно быть так что все залито одним коммитом, как минимум этап 2, 3 и 4 должны быть расположены в разных коммитах)